levizh/zephyr/drivers/i2s/i2s_hc32.c
/*
 * Copyright (C) 2022-2024, Xiaohua Semiconductor Co., Ltd.
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#define DT_DRV_COMPAT xhsc_hc32_i2s

#include <string.h>
#include <zephyr/sys/util_macro.h>
#include <zephyr/drivers/dma.h>
#include <zephyr/drivers/i2s.h>
#include <soc.h>
#include <zephyr/drivers/clock_control/hc32_clock_control.h>
#include <zephyr/drivers/dma/dma_hc32.h>
#include <zephyr/drivers/clock_control.h>
#include <zephyr/drivers/pinctrl.h>
#include "i2s_hc32.h"
#include <zephyr/logging/log.h>
#include <zephyr/irq.h>
LOG_MODULE_REGISTER(i2s_hc32);

static int i2s_hc32_tx_start(const struct device *dev);
static int i2s_hc32_rx_start(const struct device *dev);

static void i2s_dma_disable(const struct device *dev, enum i2s_dir dir)
{
	const struct i2s_hc32_cfg *cfg = dev->config;
	struct i2s_hc32_data *dev_data = dev->data;

	if (dir == I2S_DIR_TX || dir == I2S_DIR_BOTH) {
		dma_stop(cfg->dma_dev[0], cfg->channel[0]);
		if (dev_data->tx.mem_block != NULL) {
			k_mem_slab_free(dev_data->tx.cfg.mem_slab, dev_data->tx.mem_block);
			dev_data->tx.mem_block = NULL;
		}
		I2S_FuncCmd(cfg->i2s, I2S_FUNC_TX, DISABLE);
	}
	if (dir == I2S_DIR_RX || dir == I2S_DIR_BOTH) {
		dma_stop(cfg->dma_dev[1], cfg->channel[1]);
		if (dev_data->rx.mem_block != NULL) {
			k_mem_slab_free(dev_data->rx.cfg.mem_slab, dev_data->rx.mem_block);
			dev_data->rx.mem_block = NULL;
		}
		I2S_FuncCmd(cfg->i2s, I2S_FUNC_RX, DISABLE);
	}
	
	I2S_SWReset(cfg->i2s, I2S_RST_TYPE_FIFO);
}

static void i2s_hc32_reset_queue(const struct device *dev, enum i2s_dir dir)
{
	const struct i2s_hc32_cfg *cfg = dev->config;
	struct i2s_hc32_data *dev_data = dev->data;
	struct i2s_hc32_data_queue mem_blk;

	if (dir == I2S_DIR_TX || dir == I2S_DIR_BOTH) {
		while (k_msgq_get(&dev_data->tx_queue,
				  &mem_blk,
				  K_NO_WAIT) == 0) {
			k_mem_slab_free(dev_data->tx.cfg.mem_slab, mem_blk.data);
		}
		I2S_FuncCmd(cfg->i2s, I2S_FUNC_TX, DISABLE);
		MODIFY_REG32(cfg->i2s->CTRL, I2S_CTRL_TXBIRQWL, I2S_TRANS_LVL4);
	}

	if (dir == I2S_DIR_RX || dir == I2S_DIR_BOTH) {
		while (k_msgq_get(&dev_data->rx_queue,
				  &mem_blk,
				  K_NO_WAIT) == 0) {
			k_mem_slab_free(dev_data->rx.cfg.mem_slab, mem_blk.data);
		}
		I2S_FuncCmd(cfg->i2s, I2S_FUNC_RX, DISABLE);
		MODIFY_REG32(cfg->i2s->CTRL, I2S_CTRL_RXBIRQWL, I2S_RECEIVE_LVL0);
	}
	I2S_SWReset(cfg->i2s, I2S_RST_TYPE_FIFO);
}

const struct i2s_config *i2s_hc32_config_get(const struct device *dev,
						enum i2s_dir dir)
{
	struct i2s_hc32_data *dev_data = dev->data;

	if (dir == I2S_DIR_RX) {
		return &dev_data->rx.cfg;
	}

	return &dev_data->tx.cfg;
}

static int i2s_hc32_configure(const struct device *dev, enum i2s_dir dir,
				const struct i2s_config *i2s_cfg)
{
	const struct i2s_hc32_cfg *cfg = dev->config;
	struct i2s_hc32_data *dev_data = dev->data;
	struct stream *stm = (dir == I2S_DIR_RX) ? &dev_data->rx : &dev_data->tx;

	if (dir == I2S_DIR_BOTH) {
		if (dev_data->rx.state != I2S_STATE_NOT_READY &&
			dev_data->rx.state != I2S_STATE_READY &&
			dev_data->tx.state != I2S_STATE_NOT_READY &&
			dev_data->tx.state != I2S_STATE_READY) {
			LOG_ERR("invalid state");
			return -EINVAL;
		}
	} else if (stm->state != I2S_STATE_NOT_READY &&
				stm->state != I2S_STATE_READY) {
		LOG_ERR("invalid state");
		return -EINVAL;
	}

	if (i2s_cfg->frame_clk_freq == 0) {
		i2s_hc32_reset_queue(dev, dir);
		if (dir == I2S_DIR_BOTH) {
			dev_data->tx.state = I2S_STATE_NOT_READY;
			dev_data->rx.state = I2S_STATE_NOT_READY;
		} else {
			stm->state = I2S_STATE_NOT_READY;
		}
			
		if (dir == I2S_DIR_TX || dir == I2S_DIR_BOTH) {
			memset(&dev_data->tx.cfg, 0, sizeof(struct i2s_config));
		}
		if (dir == I2S_DIR_RX || dir == I2S_DIR_BOTH) {
			memset(&dev_data->rx.cfg, 0, sizeof(struct i2s_config));
		}
		return 0;
	}

	if (i2s_cfg->word_size == 16) {
		MODIFY_REG32(cfg->i2s->CFGR, (I2S_CFGR_DATLEN | I2S_CFGR_CHLEN), (I2S_DATA_LEN_16BIT | I2S_CH_LEN_16BIT));
	} else if (i2s_cfg->word_size == 24) {
		MODIFY_REG32(cfg->i2s->CFGR, (I2S_CFGR_DATLEN | I2S_CFGR_CHLEN), (I2S_DATA_LEN_24BIT | I2S_CH_LEN_32BIT));
	} else if (i2s_cfg->word_size == 32) {
		MODIFY_REG32(cfg->i2s->CFGR, (I2S_CFGR_DATLEN | I2S_CFGR_CHLEN), (I2S_DATA_LEN_32BIT | I2S_CH_LEN_32BIT));
	} else {
		LOG_ERR("invalid word size");
		return -EINVAL;
	}

	switch(i2s_cfg->format & I2S_FMT_DATA_FORMAT_MASK) {
	case I2S_FMT_DATA_FORMAT_I2S:
		MODIFY_REG32(cfg->i2s->CFGR, I2S_CFGR_I2SSTD, I2S_PROTOCOL_PHILLIPS);
		break;
	case I2S_FMT_DATA_FORMAT_PCM_SHORT:
		MODIFY_REG32(cfg->i2s->CFGR, I2S_CFGR_I2SSTD, I2S_PROTOCOL_PCM_SHORT);
		break;
	case I2S_FMT_DATA_FORMAT_PCM_LONG:
		MODIFY_REG32(cfg->i2s->CFGR, I2S_CFGR_I2SSTD, I2S_CFGR_I2SSTD);
		MODIFY_REG32(cfg->i2s->CFGR, I2S_CFGR_PCMSYNC_POS, I2S_CFGR_PCMSYNC);
		break;
	case I2S_FMT_DATA_FORMAT_LEFT_JUSTIFIED:
		MODIFY_REG32(cfg->i2s->CFGR, I2S_CFGR_I2SSTD, I2S_PROTOCOL_MSB);
		break;
	case I2S_FMT_DATA_FORMAT_RIGHT_JUSTIFIED:
		MODIFY_REG32(cfg->i2s->CFGR, I2S_CFGR_I2SSTD, I2S_PROTOCOL_LSB);
		break;
	default:
		LOG_ERR("Unsupported data format: 0x%02x", i2s_cfg->format);
		return -EINVAL;
	}

	if ((i2s_cfg->format & I2S_FMT_DATA_ORDER_LSB) || \
		(i2s_cfg->format & I2S_FMT_BIT_CLK_INV)) {
			LOG_ERR("Unsupported stream format: 0x%02x", i2s_cfg->format);
			return -EINVAL;
	}

	if ((i2s_cfg->options & I2S_OPT_BIT_CLK_SLAVE) && \
		(i2s_cfg->options & I2S_OPT_FRAME_CLK_SLAVE)) {
		MODIFY_REG32(cfg->i2s->CTRL, I2S_CTRL_WMS, I2S_MD_SLAVE);
		CLR_REG32_BIT(cfg->i2s->CTRL,(I2S_CTRL_CKOE | I2S_CTRL_LRCKOE));
	} else if (!(i2s_cfg->options & I2S_OPT_BIT_CLK_SLAVE) || \
			   !(i2s_cfg->options & I2S_OPT_FRAME_CLK_SLAVE)) {
		MODIFY_REG32(cfg->i2s->CTRL, I2S_CTRL_WMS, I2S_MD_MASTER);
		SET_REG32_BIT(cfg->i2s->CTRL, (I2S_CTRL_CKOE | I2S_CTRL_LRCKOE));
	} else {
		LOG_ERR("Unsupported operation mode: 0x%02x", i2s_cfg->options);
		return -EINVAL;
	}

	if (READ_REG32_BIT(cfg->i2s->CTRL, I2S_CTRL_WMS) == I2S_CTRL_WMS && 
		READ_REG32_BIT(cfg->i2s->CTRL, I2S_CLK_SRC_EXT) == 0) {
		LOG_ERR("i2s salver clock must be exclk");
		return -EINVAL;
	}

