levizh/zephyr/drivers/i2s/i2s_hc32.c
	if (dir == I2S_DIR_RX) {
		memcpy(&dev_data->rx.cfg, i2s_cfg, sizeof(struct i2s_config));
		MODIFY_REG32(cfg->i2s->CTRL, (I2S_CTRL_DUPLEX | I2S_CTRL_SDOE), I2S_TRANS_MD_HALF_DUPLEX_RX);
	} else if (dir == I2S_DIR_TX) {
		memcpy(&dev_data->tx.cfg, i2s_cfg, sizeof(struct i2s_config));
		MODIFY_REG32(cfg->i2s->CTRL, (I2S_CTRL_DUPLEX | I2S_CTRL_SDOE), I2S_TRANS_MD_HALF_DUPLEX_TX);
	} else if (dir == I2S_DIR_BOTH) {
		memcpy(&dev_data->tx.cfg, i2s_cfg, sizeof(struct i2s_config));
		memcpy(&dev_data->rx.cfg, i2s_cfg, sizeof(struct i2s_config));
		MODIFY_REG32(cfg->i2s->CTRL, (I2S_CTRL_DUPLEX | I2S_CTRL_SDOE), I2S_TRANS_MD_FULL_DUPLEX);
	} else {
		LOG_ERR("Unsupported transfer dir : 0x%02x", dir);
		return -EINVAL;
	}

	I2S_SetAudioFreq(cfg->i2s, i2s_cfg->frame_clk_freq);

	if (dir == I2S_DIR_BOTH) {
		dev_data->tx.state = I2S_STATE_READY;
		dev_data->rx.state = I2S_STATE_READY;
	} else {
		stm->state = I2S_STATE_READY;
	}

	return 0;
}

static int i2s_hc32_full_duplex_trigger(const struct device *dev,
							enum i2s_dir dir, enum i2s_trigger_cmd cmd)
{
	struct i2s_hc32_data *dev_data = dev->data;
	int32_t ret = 0;

	if (memcmp(&dev_data->rx.cfg, &dev_data->tx.cfg, sizeof(struct i2s_config)) != 0) {
		LOG_ERR("TX and RX configurations are different");
		return -EIO;
	}

	switch (cmd) {
	case I2S_TRIGGER_START:
		if ((dev_data->rx.state != I2S_STATE_READY) ||
			(dev_data->tx.state != I2S_STATE_READY)) {
				LOG_ERR("START trigger: invalid state %d%d", dev_data->rx.state
														,dev_data->tx.state);
				return -EIO;
		}
		ret = i2s_hc32_rx_start(dev);
		if (ret != 0) {
			LOG_ERR("START trigger failed %d", ret);
			return ret;
		}
		ret = i2s_hc32_tx_start(dev);
		if (ret != 0) {
			LOG_ERR("START trigger failed %d", ret);
			return ret;
		}
		dev_data->rx.state = dev_data->tx.state = I2S_STATE_RUNNING;
		break;
	case I2S_TRIGGER_STOP:
		if ((dev_data->rx.state != I2S_STATE_RUNNING) ||
			(dev_data->tx.state != I2S_STATE_RUNNING)) {
			LOG_ERR("STOP trigger: invalid state %d%d", dev_data->rx.state
														,dev_data->tx.state);
			return -EIO;
		}
		dev_data->rx.state = dev_data->tx.state = I2S_STATE_STOPPING;
		break;
	case I2S_TRIGGER_DRAIN:
		if ((dev_data->rx.state != I2S_STATE_RUNNING) ||
			(dev_data->tx.state != I2S_STATE_RUNNING)) {
			LOG_ERR("DRAIN trigger: invalid state %d%d", dev_data->rx.state
														,dev_data->tx.state);
			return -EIO;
		}
		dev_data->rx.state = I2S_STATE_STOPPING;
		break;
	case I2S_TRIGGER_DROP:
		if ((dev_data->rx.state == I2S_STATE_NOT_READY) ||
			(dev_data->tx.state == I2S_STATE_NOT_READY)) {
			LOG_ERR("DROP trigger: invalid state");
			return -EIO;
		}
		i2s_dma_disable(dev, I2S_DIR_BOTH);
		i2s_hc32_reset_queue(dev, I2S_DIR_BOTH);
		dev_data->rx.state = dev_data->tx.state = I2S_STATE_READY;
		break;
	case I2S_TRIGGER_PREPARE:
		if ((dev_data->rx.state != I2S_STATE_ERROR) ||
			(dev_data->tx.state != I2S_STATE_ERROR)) {
			LOG_ERR("prepare trigger: invalid state");
			return -EIO;
		}
		i2s_hc32_reset_queue(dev, I2S_DIR_BOTH);
		dev_data->rx.state = dev_data->tx.state = I2S_STATE_READY;
		break;
	default:
		return -EINVAL;
	}

	return 0;
}

static int i2s_hc32_half_duplex_trigger(const struct device *dev,
							enum i2s_dir dir, enum i2s_trigger_cmd cmd)
{
	struct i2s_hc32_data *dev_data = dev->data;
	struct stream *i2s_stream;
	int32_t ret = 0;

	if (dir == I2S_DIR_TX) {
		i2s_stream = &dev_data->tx;
	} else if (dir == I2S_DIR_RX) {
		i2s_stream = &dev_data->rx;
	}

	switch (cmd) {
	case I2S_TRIGGER_START:
		if (i2s_stream->state != I2S_STATE_READY) {
			LOG_ERR("START trigger: invalid state %d", i2s_stream->state);
			return -EIO;
		}
		if (dir == I2S_DIR_TX) {
			ret = i2s_hc32_tx_start(dev);
		} else if (dir == I2S_DIR_RX) {
			ret = i2s_hc32_rx_start(dev);
		}
		if (ret != 0) {
			LOG_ERR("START trigger failed %d", ret);
			return ret;
		}
		i2s_stream->state = I2S_STATE_RUNNING;
		break;
	
	case I2S_TRIGGER_STOP:
		if (i2s_stream->state != I2S_STATE_RUNNING) {
			LOG_ERR("STOP trigger: invalid state %d", i2s_stream->state);
			return -EIO;
		}
		i2s_stream->state = I2S_STATE_STOPPING;
		break;

	case I2S_TRIGGER_DRAIN:
		if (i2s_stream->state != I2S_STATE_RUNNING) {
			LOG_ERR("DRAIN trigger: invalid state %d", i2s_stream->state);
			return -EIO;
		}
		if (dir == I2S_DIR_RX) {
			i2s_stream->state = I2S_STATE_STOPPING;
		}
		break;

	case I2S_TRIGGER_DROP:
		if (i2s_stream->state == I2S_STATE_NOT_READY) {
			LOG_ERR("DROP trigger: invalid state");
			return -EIO;
		}
		i2s_dma_disable(dev, dir);
		i2s_hc32_reset_queue(dev, dir);
		i2s_stream->state = I2S_STATE_READY;
		break;

	case I2S_TRIGGER_PREPARE:
		if (i2s_stream->state != I2S_STATE_ERROR) {
			LOG_ERR("prepare trigger: invalid state");
			return -EIO;
		}
		i2s_hc32_reset_queue(dev, dir);
		i2s_stream->state = I2S_STATE_READY;
		break;
	default:
		return -EINVAL;
	}

	return 0;
}

static int i2s_hc32_trigger(const struct device *dev, enum i2s_dir dir,
				enum i2s_trigger_cmd cmd)
{
	if (dir == I2S_DIR_BOTH) {
		return i2s_hc32_full_duplex_trigger(dev, dir, cmd);
	} else {
		return i2s_hc32_half_duplex_trigger(dev, dir, cmd);
	}
}

static int i2s_hc32_read(const struct device *dev, void **mem_block,
			  size_t *size)
{
	struct i2s_hc32_data *dev_data = dev->data;
	struct i2s_hc32_data_queue mem_blk;
	int ret;

	if (dev_data->rx.state != I2S_STATE_RUNNING &&
		dev_data->rx.state != I2S_STATE_READY) {
		LOG_DBG("invalid state");
		return -EIO;
	}

	ret = k_msgq_get(&dev_data->rx_queue, &mem_blk,
				SYS_TIMEOUT_MS(dev_data->rx.cfg.timeout));
	if (ret != 0) {
		LOG_ERR("empty buffer");
		return -EIO;
	}

	*mem_block = mem_blk.data;
	*size = dev_data->rx.cfg.block_size;

	return 0;
}

static int i2s_hc32_write(const struct device *dev, void *mem_block,
			   size_t size)
{
	struct i2s_hc32_data *dev_data = dev->data;
	struct i2s_hc32_data_queue *w_queue = dev_data->write_queue;
	int ret;
	
	if (dev_data->tx.state != I2S_STATE_RUNNING &&
	    dev_data->tx.state != I2S_STATE_READY) {
		LOG_DBG("invalid state");
		return -EIO;
	}

	/*if (size != dev_data->tx.cfg.block_size) {
		LOG_ERR("This device can only write blocks of %u bytes",
			dev_data->tx.cfg.block_size);
		return -EIO;
	}*/

	dev_data->w_i_index = \
		(++dev_data->w_i_index >= (CONFIG_I2S_HC32_RX_BLOCK_COUNT + 1)) ? 0 : dev_data->w_i_index;
	if (dev_data->w_i_index == dev_data->w_o_index) {
		return -ENOMEM;
	}
	w_queue[dev_data->w_i_index].data = mem_block;
	w_queue[dev_data->w_i_index].len = size;

	ret = k_msgq_put(&dev_data->tx_queue,
			 &w_queue[dev_data->w_i_index],
			 SYS_TIMEOUT_MS(dev_data->tx.cfg.timeout));
	if (ret < 0) {
		return ret;
	}
	LOG_DBG("Queued TX %p", mem_block);

