levizh/zephyr/drivers/i2s/i2s_hc32.c
	return 0;
}

static const struct i2s_driver_api i2s_hc32_driver_api = {
	.configure = i2s_hc32_configure,
	.read = i2s_hc32_read,
	.write = i2s_hc32_write,
	.trigger = i2s_hc32_trigger,
	.config_get = i2s_hc32_config_get,
};

static int i2s_hc32_init(const struct device *dev)
{
	const struct device *const clk = DEVICE_DT_GET(HC32_CLOCK_CONTROL_NODE);
	const struct i2s_hc32_cfg *cfg = dev->config;
	struct i2s_hc32_data *dev_data = dev->data;
	int ret;

	if (!device_is_ready(clk)) {
		LOG_ERR("clock control device not ready");
		return -ENODEV;
	}

	/* Move pins to active/default state */
	ret = pinctrl_apply_state(cfg->pcfg, PINCTRL_STATE_DEFAULT);
	if (ret < 0) {
		LOG_ERR("I2S pinctrl setup failed (%d)", ret);
		return ret;
	}

	/* Enable device clock. */
	if (clock_control_on(clk,
			     (clock_control_subsys_t) &cfg->mod_clk[0]) != 0) {
		LOG_ERR("i2c: failure enabling clock");
		return -EIO;
	}

	k_msgq_alloc_init(&dev_data->tx_queue, sizeof(struct i2s_hc32_data_queue), CONFIG_I2S_HC32_TX_BLOCK_COUNT);
	k_msgq_alloc_init(&dev_data->rx_queue, sizeof(struct i2s_hc32_data_queue), CONFIG_I2S_HC32_RX_BLOCK_COUNT);

	if (cfg->i2s_src_clk == 0) {
		MODIFY_REG32(cfg->i2s->CTRL, (I2S_CTRL_CLKSEL | I2S_CTRL_I2SPLLSEL), \
									 I2S_CLK_SRC_PLL);
		SET_REG32_BIT(cfg->i2s->CTRL, I2S_CTRL_MCKOE );
		switch (cfg->mod_clk[0].bits) {
		case HC32_FCG1_PERIPH_I2S1:
			MODIFY_REG16(CM_CMU->I2SCKSEL, CMU_I2SCKSEL_I2S1CKSEL, cfg->pll_src_cfg << CMU_I2SCKSEL_I2S1CKSEL_POS);
			break;
		case HC32_FCG1_PERIPH_I2S2:
			MODIFY_REG16(CM_CMU->I2SCKSEL, CMU_I2SCKSEL_I2S2CKSEL, cfg->pll_src_cfg << CMU_I2SCKSEL_I2S1CKSEL_POS);
			break;
		case HC32_FCG1_PERIPH_I2S3:
			MODIFY_REG16(CM_CMU->I2SCKSEL, CMU_I2SCKSEL_I2S3CKSEL, cfg->pll_src_cfg << CMU_I2SCKSEL_I2S1CKSEL_POS);
			break;
		case HC32_FCG1_PERIPH_I2S4:
			MODIFY_REG16(CM_CMU->I2SCKSEL, CMU_I2SCKSEL_I2S4CKSEL, cfg->pll_src_cfg << CMU_I2SCKSEL_I2S1CKSEL_POS);
			break;
		default:
			break;
		}
	} else {
		MODIFY_REG32(cfg->i2s->CTRL, (I2S_CTRL_CLKSEL | I2S_CTRL_I2SPLLSEL), 
									  I2S_CLK_SRC_EXT);
		CLR_REG32_BIT(cfg->i2s->CTRL, I2S_CTRL_MCKOE );
	}

	MODIFY_REG32(cfg->i2s->CTRL, I2S_CTRL_TXBIRQWL, I2S_TRANS_LVL4);
	MODIFY_REG32(cfg->i2s->CTRL, I2S_CTRL_RXBIRQWL, I2S_RECEIVE_LVL0);
	
	return 0;
}

static int i2s_start_dma(const struct device *dev, uint32_t channel,
					struct dma_config *config)
{
	int ret;

	ret = dma_config(dev, channel, config);
	if (ret != 0) {
		return ret;
	}

	ret = dma_start(dev, channel);
	if (ret != 0) {
		return ret;
	}

	return ret;
}

static int i2s_reload_dma(const struct device *dev, uint32_t channel,
			uint32_t src, uint32_t dst, size_t size)		
{
	int ret;

	ret = dma_reload(dev, channel, src, dst, size);
	if (ret != 0) {
		return ret;
	}

	ret = dma_start(dev, channel);
	if (ret != 0) {
		return ret;
	}

	return ret;
}

static void i2s_hc32_tx_disable(const struct device *dev)
{
	const struct i2s_hc32_cfg *cfg = dev->config;
	uint32_t timeout = 0;

	while (SET != I2S_GetStatus(cfg->i2s, I2S_FLAG_TX_ERR)) {
		if (++timeout >= 10000) {
			break;
		}
	}
	I2S_FuncCmd(cfg->i2s, I2S_FUNC_TX, DISABLE);
	I2S_SWReset(cfg->i2s, I2S_RST_TYPE_FIFO);
	I2S_ClearStatus(cfg->i2s, I2S_FLAG_TX_ERR);
}

static void i2s_hc32_tx_dma_callback(const struct device *dev, void *user_data,
				uint32_t channel, int status)
{
	struct dma_hc32_config_user_data *hc32_user_data = \
		(struct dma_hc32_config_user_data *)user_data;
	const struct device *i2s_dev = \
		(const struct device *)hc32_user_data->user_data;
	const struct i2s_hc32_cfg *cfg = i2s_dev->config;
	struct i2s_hc32_data *dev_data = i2s_dev->data;
	struct dma_config *i2s_dma_config = cfg->dma_conf;
	struct dma_block_config *i2s_dma_block_conf = i2s_dma_config[0].head_block;
	uint32_t remain;
	int ret;
	static uint16_t i = 0;
	static uint32_t buf[6];

	dma_stop(dev, channel);

	MODIFY_REG32(cfg->i2s->CTRL, I2S_CTRL_TXBIRQWL, I2S_TRANS_LVL4);

	if (status != 0) {
		dev_data->tx.state = I2S_STATE_ERROR;
		I2S_FuncCmd(cfg->i2s, I2S_FUNC_TX, DISABLE);
		I2S_SWReset(cfg->i2s, I2S_RST_TYPE_FIFO);
		return;
	}

	if (channel == cfg->channel[0]) {
		if ((i2s_dma_block_conf->source_address - 
				(uint32_t)dev_data->tx.mem_block + 
				i2s_dma_block_conf->block_size) >= dev_data->tx.len) {
			if (i < 6) {
				buf[i++] = (uint32_t)dev_data->tx.mem_block;
			}
			k_mem_slab_free(dev_data->tx.cfg.mem_slab, dev_data->tx.mem_block);
			dev_data->tx.mem_block = NULL;

			if (dev_data->tx.state == I2S_STATE_STOPPING) {
				dev_data->tx.state = I2S_STATE_READY;
				i2s_hc32_tx_disable(i2s_dev);
				return;
			}

			ret= k_msgq_get(&dev_data->tx_queue, &dev_data->tx.mem_block, K_NO_WAIT);
			if (ret == 0) {
				dev_data->w_o_index = \
				(++dev_data->w_o_index >= (CONFIG_I2S_HC32_TX_BLOCK_COUNT + 1)) ?
					0 : dev_data->w_o_index;
				i2s_dma_block_conf->source_address = (uint32_t)dev_data->tx.mem_block;
				i2s_dma_block_conf->block_size = \
					dev_data->tx.len > (UINT16_MAX / 4 * 4) ? 
					(UINT16_MAX / 4 * 4) : dev_data->tx.len;
				ret = i2s_reload_dma(dev, channel, 
								i2s_dma_block_conf->source_address, 
								(uint32_t)&cfg->i2s->TXBUF,
								i2s_dma_block_conf->block_size);
				if (ret != 0) {
					dev_data->tx.state = I2S_STATE_READY;
					dev_data->w_i_index = \
									(++dev_data->w_i_index >= 
									(CONFIG_I2S_HC32_RX_BLOCK_COUNT + 1)) ? 
									0 : dev_data->w_i_index;
					k_msgq_put(&dev_data->tx_queue, &dev_data->tx.mem_block,
															K_NO_WAIT);
					i2s_hc32_tx_disable(i2s_dev);
					return;
				}
				MODIFY_REG32(cfg->i2s->CTRL, I2S_CTRL_TXBIRQWL, I2S_TRANS_LVL3);
			} else {
				dev_data->tx.state = I2S_STATE_READY;
				i2s_hc32_tx_disable(i2s_dev);
			}
		} else {
			i2s_dma_block_conf->source_address += i2s_dma_block_conf->block_size;
			remain = dev_data->tx.len - (i2s_dma_block_conf->source_address - 
				(uint32_t)dev_data->tx.mem_block);
			i2s_dma_block_conf->block_size = \
			(remain > (UINT16_MAX / 4 * 4)) ? (UINT16_MAX / 4 * 4) : remain;
			ret = i2s_reload_dma(dev, channel, 
								i2s_dma_block_conf->source_address, 
								(uint32_t)&cfg->i2s->TXBUF, 
								i2s_dma_block_conf->block_size);
			if (ret != 0) {
				dev_data->tx.state = I2S_STATE_READY;
				i2s_hc32_tx_disable(i2s_dev);
				k_mem_slab_free(dev_data->tx.cfg.mem_slab, 
									dev_data->tx.mem_block);
				return;
			}
			MODIFY_REG32(cfg->i2s->CTRL, I2S_CTRL_TXBIRQWL, I2S_TRANS_LVL3);
		}
	}
}

static void i2s_hc32_rx_dma_callback(const struct device *dev, void *user_data,
				uint32_t channel, int status)
{
	struct dma_hc32_config_user_data *hc32_user_data = \
		(struct dma_hc32_config_user_data *)user_data;
	const struct device *i2s_dev = \
		(const struct device *)hc32_user_data->user_data;
	const struct i2s_hc32_cfg *cfg = i2s_dev->config;
	struct i2s_hc32_data *dev_data = i2s_dev->data;
	struct dma_config *i2s_dma_config = cfg->dma_conf;
	struct dma_block_config *i2s_dma_block_conf = i2s_dma_config[1].head_block;
	uint32_t remain;
	int ret;

