levizh/zephyr/drivers/i2s/i2s_hc32.c
	MODIFY_REG32(cfg->i2s->CTRL, I2S_CTRL_RXBIRQWL, I2S_RECEIVE_LVL0);

	/*if (RESET != I2S_GetStatus(cfg->i2s, I2S_FLAG_RX_ERR)) {
		I2S_ClearStatus(cfg->i2s, I2S_FLAG_RX_ERR);
		i2s_dma_disable(i2s_dev, I2S_DIR_RX);
		dev_data->rx.state = I2S_STATE_ERROR;
		return;
	}*/

	dma_stop(dev, channel);

	if (status != 0) {
		dev_data->rx.state = I2S_STATE_ERROR;
		i2s_dma_disable(i2s_dev, I2S_DIR_RX);
		return;
	}

	if ((i2s_dma_block_conf->dest_address - (uint32_t)dev_data->rx.mem_block + 
			i2s_dma_block_conf->block_size) < dev_data->rx.cfg.block_size) {
		i2s_dma_block_conf->dest_address += i2s_dma_block_conf->block_size;
		remain = dev_data->rx.cfg.block_size -
		(i2s_dma_block_conf->dest_address - (uint32_t)dev_data->rx.mem_block);
		i2s_dma_block_conf->block_size = \
		(remain > (UINT16_MAX / 4 * 4)) ? (UINT16_MAX / 4 * 4) : remain;
		ret = i2s_reload_dma(dev, channel, (uint32_t)&cfg->i2s->RXBUF, 
				i2s_dma_block_conf->dest_address, 
				i2s_dma_block_conf->block_size);
		if (ret != 0) {
			dev_data->rx.state = I2S_STATE_READY;
			i2s_dma_disable(i2s_dev, I2S_DIR_RX);
			return;
		}
		if (RESET != I2S_GetStatus(cfg->i2s, I2S_FLAG_RX_ERR)) {
			I2S_ClearStatus(cfg->i2s, I2S_FLAG_RX_ERR);
		}
		MODIFY_REG32(cfg->i2s->CTRL, I2S_CTRL_RXBIRQWL, I2S_RECEIVE_LVL3);
	} else {
		ret = k_msgq_put(&dev_data->rx_queue, &dev_data->rx.mem_block, K_NO_WAIT);
		if (ret < 0) {
			dev_data->rx.state = I2S_STATE_ERROR;
			i2s_dma_disable(i2s_dev, I2S_DIR_RX);
			return;
		}

		if (dev_data->rx.state == I2S_STATE_STOPPING) {
			dev_data->rx.state = I2S_STATE_READY;
			I2S_FuncCmd(cfg->i2s, I2S_FUNC_RX, DISABLE);
			I2S_SWReset(cfg->i2s, I2S_RST_TYPE_FIFO);
			return;
		}

		ret = k_mem_slab_alloc(dev_data->rx.cfg.mem_slab, &dev_data->rx.mem_block, 
								K_NO_WAIT);
		if (ret != 0) {
			dev_data->rx.state = I2S_STATE_ERROR;
			i2s_dma_disable(i2s_dev, I2S_DIR_RX);
			return;
		}

		i2s_dma_block_conf->dest_address = (uint32_t)dev_data->rx.mem_block;
		i2s_dma_block_conf->block_size = 
			dev_data->rx.cfg.block_size > (UINT16_MAX / 4 * 4) ? 
			(UINT16_MAX / 4 * 4) : dev_data->rx.cfg.block_size;
		ret = i2s_reload_dma(dev, channel, (uint32_t)&cfg->i2s->RXBUF, 
								i2s_dma_block_conf->dest_address, 
								i2s_dma_block_conf->block_size);
		if (ret != 0) {
			dev_data->rx.state = I2S_STATE_READY;
			i2s_dma_disable(i2s_dev, I2S_DIR_RX);
			return;
		}
		if (RESET != I2S_GetStatus(cfg->i2s, I2S_FLAG_RX_ERR)) {
			I2S_ClearStatus(cfg->i2s, I2S_FLAG_RX_ERR);
		}
		MODIFY_REG32(cfg->i2s->CTRL, I2S_CTRL_RXBIRQWL, I2S_RECEIVE_LVL3);
	}
}

static int i2s_hc32_tx_start(const struct device *dev)
{
	const struct i2s_hc32_cfg *cfg = dev->config;
	struct i2s_hc32_data *dev_data = dev->data;
	struct dma_config *i2s_dma_config = cfg->dma_conf;
	struct dma_block_config *i2s_tx_dma_block_conf = \
					i2s_dma_config[0].head_block;
	int ret = 0;

	ret= k_msgq_get(&dev_data->tx_queue, &dev_data->tx.mem_block, K_NO_WAIT);
	if (ret != 0) {
		LOG_ERR("No buffer in input queue to start");
		return -ENOMEM;
	}
	dev_data->w_o_index = \
		(++dev_data->w_o_index >= (CONFIG_I2S_HC32_TX_BLOCK_COUNT + 1)) ?
			0 : dev_data->w_o_index;
			
	if ((i2s_tx_dma_block_conf->dest_addr_adj != DMA_ADDR_ADJ_NO_CHANGE) && \
	 	(i2s_tx_dma_block_conf->source_addr_adj != DMA_ADDR_ADJ_INCREMENT)) {
		return -EIO;
	}

	if (dev_data->tx.cfg.word_size == 16) {
		i2s_dma_config[0].source_data_size = i2s_dma_config[0].dest_data_size = 2;
	} else {
		i2s_dma_config[0].source_data_size = i2s_dma_config[0].dest_data_size = 4;
	}

	i2s_tx_dma_block_conf->source_address = (uint32_t)dev_data->tx.mem_block;
	i2s_tx_dma_block_conf->block_size = \
		dev_data->tx.len > (UINT16_MAX / 4 * 4) ? (UINT16_MAX / 4 * 4) : dev_data->tx.len;
	ret = i2s_start_dma(cfg->dma_dev[0], cfg->channel[0], i2s_dma_config);
	if (ret != 0) {
		dev_data->w_i_index = \
						(++dev_data->w_i_index >= 
						(CONFIG_I2S_HC32_RX_BLOCK_COUNT + 1)) ? 
						0 : dev_data->w_i_index;
		if (dev_data->w_i_index == dev_data->w_o_index) {
			return -ENOMEM;
		}
		ret = k_msgq_put(&dev_data->tx_queue, &dev_data->tx.mem_block,
															K_NO_WAIT);
		if (ret < 0) {
			return -ENOMEM;
		}
		return -EIO;
	}
	MODIFY_REG32(cfg->i2s->CTRL, I2S_CTRL_TXBIRQWL, I2S_TRANS_LVL3);
	I2S_FuncCmd(cfg->i2s, I2S_FUNC_TX, ENABLE);

	return ret;
}

static int i2s_hc32_rx_start(const struct device *dev)
{
	const struct i2s_hc32_cfg *cfg = dev->config;
	struct i2s_hc32_data *dev_data = dev->data;
	struct dma_config *i2s_dma_config = cfg->dma_conf;
	struct dma_block_config *i2s_rx_dma_block_conf = \
					i2s_dma_config[1].head_block;
	int ret = 0;

	ret = k_mem_slab_alloc(dev_data->rx.cfg.mem_slab, &dev_data->rx.mem_block, 
								K_NO_WAIT);
	if (ret != 0) {
		return -ENOMEM;
	}

	if ((i2s_rx_dma_block_conf->dest_addr_adj != DMA_ADDR_ADJ_INCREMENT) && \
	 	(i2s_rx_dma_block_conf->source_addr_adj != DMA_ADDR_ADJ_NO_CHANGE)) {
		return -EIO;
	}

	if (dev_data->rx.cfg.word_size == 16) {
		i2s_dma_config[1].source_data_size = i2s_dma_config[1].dest_data_size = 2;
	} else {
		i2s_dma_config[1].source_data_size = i2s_dma_config[1].dest_data_size = 4;
	}

	i2s_rx_dma_block_conf->dest_address = (uint32_t)dev_data->rx.mem_block;
	i2s_rx_dma_block_conf->block_size = 
		dev_data->rx.cfg.block_size > (UINT16_MAX / 4 * 4) ? 
		(UINT16_MAX / 4 * 4) : dev_data->rx.cfg.block_size;
	ret = i2s_start_dma(cfg->dma_dev[1], cfg->channel[1], &i2s_dma_config[1]);
	if (ret != 0) {
		k_mem_slab_free(dev_data->rx.cfg.mem_slab, dev_data->rx.mem_block);
		return EIO;
	}

	if (RESET != I2S_GetStatus(cfg->i2s, I2S_FLAG_RX_ERR)) {
		I2S_ClearStatus(cfg->i2s, I2S_FLAG_RX_ERR);
	}
	MODIFY_REG32(cfg->i2s->CTRL, I2S_CTRL_RXBIRQWL, I2S_RECEIVE_LVL3);
	I2S_FuncCmd(cfg->i2s, I2S_FUNC_RX, ENABLE);

	return ret;
}

#define HC32_I2C_DMA_INIT(inst)	\
static void i2s_hc32_tx_dma_callback(const struct device *dev, void *user_data,	\
				uint32_t channel, int status);	\
static void i2s_hc32_rx_dma_callback(const struct device *dev, void *user_data,	\
				uint32_t channel, int status);	\
const uint32_t i2s_dma_config_vaule_##inst[2] = {HC32_DMA_CHANNEL_CONFIG(inst, tx_dma), \
								HC32_DMA_CHANNEL_CONFIG(inst, rx_dma)}; \
struct dma_block_config dma_block_config_##inst[2] = \
{	\
	{	\
		.dest_addr_adj = HC32_DMA_CONFIG_DEST_ADDR_INC(i2s_dma_config_vaule_##inst[0]), \
		.source_addr_adj = HC32_DMA_CONFIG_SOURCE_ADDR_INC(i2s_dma_config_vaule_##inst[0]), \
		.dest_address = (uint32_t)&(((CM_I2S_TypeDef *)DT_INST_REG_ADDR(inst))->TXBUF),	\
	},		\
	{	\
		.source_addr_adj = HC32_DMA_CONFIG_SOURCE_ADDR_INC(i2s_dma_config_vaule_##inst[1]), \
		.dest_addr_adj = HC32_DMA_CONFIG_DEST_ADDR_INC(i2s_dma_config_vaule_##inst[1]), \
		.source_address = (uint32_t)&(((CM_I2S_TypeDef *)DT_INST_REG_ADDR(inst))->RXBUF),	\
	}		\
};	\
struct dma_hc32_config_user_data i2s_dma_user_data_##inst[2] = \
{	\
	{	\
		.slot = HC32_DMA_SLOT(inst, tx_dma),\
		.user_data = (void*)DEVICE_DT_INST_GET(inst),	\
	},	\
	{	\
		.slot = HC32_DMA_SLOT(inst, rx_dma),\
		.user_data = (void*)DEVICE_DT_INST_GET(inst),	\
	},	\
}; 	\
struct dma_config i2s_dma_config_##inst[2] = \
{	\
	{	\
		.channel_direction = HC32_DMA_CONFIG_DIRECTION(i2s_dma_config_vaule_##inst[0]), \
		.block_count = 1,	\
		.source_burst_length = 1,	\
		.dest_burst_length = 1,	\
		.source_data_size = HC32_DMA_CONFIG_DATA_SIZE(i2s_dma_config_vaule_##inst[0]),	\
		.dest_data_size = HC32_DMA_CONFIG_DATA_SIZE(i2s_dma_config_vaule_##inst[0]),	\
		.head_block = &dma_block_config_##inst[0],	\
		.user_data = &i2s_dma_user_data_##inst[0],	\
		.dma_callback = i2s_hc32_tx_dma_callback,	\
	},	\
	{	\
		.channel_direction = HC32_DMA_CONFIG_DIRECTION(i2s_dma_config_vaule_##inst[1]), \
		.block_count = 1,	\
		.source_burst_length = 1,	\
		.dest_burst_length = 1,	\
		.source_data_size = HC32_DMA_CONFIG_DATA_SIZE(i2s_dma_config_vaule_##inst[1]),	\
		.dest_data_size = HC32_DMA_CONFIG_DATA_SIZE(i2s_dma_config_vaule_##inst[1]),	\
		.head_block = &dma_block_config_##inst[1],	\
		.user_data = &i2s_dma_user_data_##inst[1],	\
		.dma_callback = i2s_hc32_rx_dma_callback,	\
	}	\
};
#define HC32_I2S_DMA_CONFIG(inst)	\
	.dma_dev = {	\
		DEVICE_DT_GET(HC32_DMA_CTLR(inst, tx_dma)),	\
		DEVICE_DT_GET(HC32_DMA_CTLR(inst, rx_dma)),	\
	},	\
	.dma_conf = i2s_dma_config_##inst,		\
	.channel = {	\
		HC32_DMA_CHANNEL(inst, tx_dma),	\
		HC32_DMA_CHANNEL(inst, rx_dma),	\
	}	

#define I2S_HC32_INIT(index)							\
HC32_I2C_DMA_INIT(index)			\
static struct i2s_hc32_data_queue i2s_hc32_data_queue_##index[CONFIG_I2S_HC32_TX_BLOCK_COUNT + 1];	\
									\
PINCTRL_DT_INST_DEFINE(index);						\
									\
static const struct hc32_modules_clock_sys mudules_clk_##index[] =			\
				 HC32_MODULES_CLOCKS(DT_DRV_INST(index));		\
									\
static const struct i2s_hc32_cfg i2s_hc32_config_##index = {		\
	.i2s = (CM_I2S_TypeDef *)DT_INST_REG_ADDR(index),			\
	.mod_clk = mudules_clk_##index,						\
	.pcfg = PINCTRL_DT_INST_DEV_CONFIG_GET(index),			\
	.i2s_src_clk = DT_PROP_OR(DT_DRV_INST(index), src_clk, 0),	\
	.pll_src_cfg = DT_PROP_OR(DT_DRV_INST(index), i2s_pll_clk, 0),	\
	.tx_fifo_level = DT_PROP_OR(DT_DRV_INST(index), tx_fifo_level, 2),	\
	.rx_fifo_level = DT_PROP_OR(DT_DRV_INST(index), rx_fifo_level, 2),	\
	HC32_I2S_DMA_CONFIG(index),		\
};									\
									\
static struct i2s_hc32_data i2s_hc32_data_##index = {			\
	.write_queue = i2s_hc32_data_queue_##index,	\
};									\
DEVICE_DT_INST_DEFINE(index,						\
		      &i2s_hc32_init, NULL,			\
		      &i2s_hc32_data_##index,				\
		      &i2s_hc32_config_##index, POST_KERNEL,		\
		      CONFIG_I2S_INIT_PRIORITY, &i2s_hc32_driver_api);

DT_INST_FOREACH_STATUS_OKAY(I2S_HC32_INIT)
